package org.example.lessons_20240729;

public class Main {
//    public static void main(String[] args) {
////        Создайте и инициализируйте переменную int = 10
////        В блоке if сравните созданную переменную со значением 15
////        После блока добавьте инструкцию System.out.println("I am Not in if");
////        Проанализируйте вывод
////       if
//        int i = 10;
//        if (i > 15) {
//            System.out.println("I am Not in if");
//        }
//        System.out.println("I am Not in if");
////    if-else
//        int j = 20;
//        if (j > 15) {
//            System.out.println("j > 15");
//        } else {
//            System.out.println("j < 15");
//        }
//    }
//    //        nested if
//    int j = 20;
//        if (j > 15) {
//        System.out.println("j > 15");
//        if (j < 20) {
//            System.out.println("15 < j < 20");
//        }
//    }
        //    Создайте и инициализируйте переменную int i = 20
//    В блоке if сравните созданную переменную со значением 10 (==)
//    В блоке if добавить инструкцию System.out.println("i is 10")
//    Добавьте блок else if и сравните переменную со значением 15 (==) , внутри блока добавить инструкцию System.out.println("i is 15");
//    Добавите еще один блок else if и сравните переменную со значением 20 (==) 
//    Добавьте блок else добавьте инструкцию System.out.println("i is not present");
//    Проанализируйте вывод

//    int i = 10;
//if (i == 10) {
//        System.out.println("i is 10");
//    } else if (i == 15) {
//        System.out.println("i is 15");
//    } else if (i == 20) {
//        System.out.println("i is 20");
//    } else {
//        System.out.println("i is not present");
//    }


//    int day = 8;
//if (day == 1) {
//        System.out.println("Monday");
//    } else if (day == 2) {
//        System.out.println("Tuesday");
//    } else if (day == 3) {
//        System.out.println("Wednesday");
//    } else if (day == 4) {
//        System.out.println("Thursday");
//    } else if (day == 5) {
//        System.out.println("Friday");
//    } else if (day == 6) {
//        System.out.println("Saturday");
//    } else if (day == 7) {
//        System.out.println("Sunday");
//    } else {
//        System.out.println("Unsupported day");
//    }
//    Создайте и инициализируйте переменную boolean t = true;
//    Добавьте инструкцию System.out.println("Before the return instruction");
//    В блоке if определите оператор return
//    Добавьте инструкцию после блока if System.out.println("This won't execute");
//    Запустите код
//    Проанализируйте вывод используя режим дебаггера
//    Переопределите переменную t = false
//    Проанализируйте вывод используя режим дебаггера


//    boolean flag = true;
//System.out.println("Before the return instruction");
//if (flag) {
//        return;
//    }
//System.out.println("This won't execute");
//
//if (x > 30 && x < 50 && x != 5) {
//System.out.println ("number from 30 to 50, and not equal to 5");
//    }
//if (x < 10 || x > 40) {
//System.out.println ("number is or less than 10 or greater than 40");
//    }
//if (y == 5.5 || y == 10 || y == 8.3) {
//System.out.println ("number is or 5.5 or 10 or 8.3");
//    }
//if (y == 5.5 && y == 10) {
//System.out.println ("Is there something wrong?");
    }

//        Создать программу, которая будет проверять попало ли
//        случайно выбранное из отрезка [5;155] целое число в
//        интервал (25;100) и сообщать результат на экран.

//    int x = 600;
//        if (x > 25 && x < 100) {
//        System.out.println("Число принадлежит отрезку 25 : 100 и отрезку 5 : 155");
//    } else if (x >= 5 && x <= 155) {
//        System.out.println("Число принадлежит отрезку 5 : 155");
//    } else {
//        System.out.println("Число НЕ принадлежит отрезку 25 : 100 и отрезку 5 : 155 ");
//    }
//}
//}