package org.example.lessons._20240711;

public class Unary {
    public static void main(String[] args) {
//        Создайте класс Unary
//Создайте переменную с положительным знаком
//Измените знак на отрицательный используя унарный минус
//Результат распечатайте в консоле

        int i = 3;
//        i--;
        System.out.println(-i);
    }
}
